# Король Лев
# Создайте класс Lion. В нем должен быть метод roar, который печатает на экран строку «Rrrrrrr!!!»
#
# Необходимо написать только определение класса

class Lion:
    def roar(self):
        print("Rrrrrrr!!!")